# Напишите функцию -- чат-бот, который 
#         Всегда отвечает “Конечно!” на любой вопрос
#         Всегда отвечает “Успокойся”, если ты кричишь на него ВОТ ТАК!
#         Всегда отвечает “Как классно, когда ты молчишь. Продолжай в том же духе!” Если вызвал функцию, но ничего не передал.
#         # В любых других случаях, отвечает “ну и что”

# =======================================================================
# Напишите функцию, которая принимает слово и возвращает True, если слово изограмма (т.е. все буквы в слове уникальны). Иначе возвращает False




# ============================================================================
# Напишите функцию, которая проверяет, сколько раз каждое слово в переданной фразе было использовано. Например: “Money, money, money, it’s always sunny, in the richmen’s world”. money: 3, it’s: 1, always: 1, sunny: 1, in: 1, the: 1, richmen’s: 1, world: 1.