# GIT - распределенная система контроля версий
# Эти система для отслиживания и ведения истори изменения файлов в вашем проекте. При помищи распределлоности  git еще и организоваются командая робота.

# репозиторий - это хранилище ващего кода и истори его изменений

# GitHub - Веб сайт для размещения git- репотизоров  с сомвестной разроботке проектов 

# Команда GIT:
# 1. git init -> Она создает локальный гит репозиторий у вас на пк, в той дирокторий котрой была прописина команда.

# 2. git status -> команда для проверки статусов наших файлов

# 3. git add -> команда для добавления файлов в систему отслеживания гита, после этой команды изменения начинают фиксироваться 


#  4.git commit -m 'comment' - > команда для сохреннение версии в лакальном репозитори, вместе с коментарием к изменнениям 

# 5. git remote add origin <url> ->Это команда для того что бы устоновить связ локального репозитори с удаленом в гитхабе

# 6. git push -> команда для отпраки ваших изменений в локальным репо в удаленный репо
        #  git push origin main

# --------------------------
# 1*) git init
            # 2) git add.
            # 3) git commit -m ''
# 4*) git remote add origin <url>
            # 5) pit push origin main